In [82]:

import pandas as pd
import scipy.stats as stats

In [83]:
data = pd.read_csv('Sales_data_zone_wise.csv')

In [84]:
data.head()

       Month  Zone - A  Zone - B  Zone - C  Zone - D
0  Month - 1   1483525   1748451   1523308   2267260
1  Month - 2   1238428   1707421   2212113   1994341
2  Month - 3   1860771   2091194   1282374   1241600
3  Month - 4   1871571   1759617   2290580   2252681
4  Month - 5   1244922   1606010   1818334   1326062

In [85]:
data.describe()

           Zone - A      Zone - B      Zone - C      Zone - D
count  2.900000e+01  2.900000e+01  2.900000e+01  2.900000e+01
mean   1.540493e+06  1.755560e+06  1.772871e+06  1.842927e+06
std    2.619401e+05  1.683899e+05  3.331937e+05  3.750165e+05
min    1.128185e+06  1.527574e+06  1.237722e+06  1.234311e+06
25%    1.305972e+06  1.606010e+06  1.523308e+06  1.520406e+06
50%    1.534390e+06  1.740365e+06  1.767047e+06  1.854412e+06
75%    1.820196e+06  1.875658e+06  2.098463e+06  2.180416e+06
max    2.004480e+06  2.091194e+06  2.290580e+06  2.364132e+06

# 1. Mean Sales of Each Zone

In [86]:
data[['Zone - A', 'Zone - B', 'Zone - C', 'Zone - D']].agg('mean').round()

Zone - A    1540493.0
Zone - B    1755560.0
Zone - C    1772871.0
Zone - D    1842927.0
dtype: float64

In [87]:
data.head()

       Month  Zone - A  Zone - B  Zone - C  Zone - D
0  Month - 1   1483525   1748451   1523308   2267260
1  Month - 2   1238428   1707421   2212113   1994341
2  Month - 3   1860771   2091194   1282374   1241600
3  Month - 4   1871571   1759617   2290580   2252681
4  Month - 5   1244922   1606010   1818334   1326062

# SUM OF EACH ZONE SALES MONTH WISE

In [88]:
data['Monthwise Sum of All Zones'] = data.sum(axis =1)
data.head()

,Month,Zone - A,Zone - B,Zone - C,Zone - D,Monthwise Sum of All Zones
0,Month - 1,1483525,1748451,1523308,2267260,7022544
1,Month - 2,1238428,1707421,2212113,1994341,7152303
2,Month - 3,1860771,2091194,1282374,1241600,6475939
3,Month - 4,1871571,1759617,2290580,2252681,8174449
4,Month - 5,1244922,1606010,1818334,1326062,5995328

In [89]:
zonea = data["Zone - A"]
zoneb = data["Zone - B"]
zonec = data["Zone - C"]
zoned = data["Zone - D"]

In [90]:
from scipy.stats import f_oneway

# NULL HYPOTHESIS 
### H0:All zones do not generate the same amount of sales)

# ALTERNATE HYPOTHESIS 
### H1: (All zones do generate the same amount of sales)

In [91]:
f_oneway(zonea, zoneb, zonec, zoned)

F_onewayResult(statistic=5.672056106843581, pvalue=0.0011827601694503335)

# Since the pvalue if less than p(0.05), we can reject the Null Hypothesis and Accept the Alternate Hypothesis.

# H1: (All zones do generate the same amount of sales)